<meta charset="UTF-8">
<?php
//ЧАСТЬ 1
echo 'ЧАСТЬ 1<br>';
//задание 1
$a = 3;
$b = $a;
echo 'задание #1<br>'.$b.'<br>';
//задание 2
$a=10;
$b=2;
echo 'задание #2<br>';
echo ($a+$b)/(($a+$b)/2).'<br>';
echo ($a-$b)/(($a+$b)/2).'<br>';
echo ($a*$b)/(($a+$b)/2).'<br>';
echo ($a/$b)/(($a+$b)/2).'<br>';
//задание 3
echo 'задание #3<br>';
$c=15;
$d=2;
$result = $c + $d;
echo $result.'<br>';
//задание 4
echo 'задание #4<br>';
$a=10;
$b=2;
$c=5;
echo ($a+$b+$c)/(($a+$b+$c)/3).'<br>';
//задание 5
echo 'задание #5<br>';
$a=17;
$b=10;
$c=$a-$b;
$d=17;
$result=$d+$c;
echo $result.'<br>.<br>';

//ЧАСТЬ 2
echo 'ЧАСТЬ 2<br>';
//задание 1
echo 'задание #1<br>';
$text='Привет, Мир!';
echo $text." Моя первая программа!".'<br>';
//задание 2
echo 'задание #2<br>';
$text1='Привет, ';
$text2='Мир!';
echo $text1.$text2.'<br>';
//задание 3
echo 'задание #3<br>';
$name='Сажод';
echo 'Привет, '.$name.'!<br>';
$text='';
$text='Новый текст';
//4
echo 'задание #4<br>';
$age=19;
$height=177;
echo 'Мой возраст: '.$age.' | Мой возраст: '.$height.'<br>';
//задание 5
echo 'задание #5<br>';
$text='abcde';
echo $text[0].$text[2].$text[4].'<br>'.'<br>';

//ЧАСТЬ 3
echo 'ЧАСТЬ 3<br>';
//задание 1
echo 'задание #1<br>';
$arr=['a','b','c'];
var_dump($arr);
echo '<br>';
for($i=0;$i<count($arr);$i++){
    var_dump($arr[$i]);
}
echo '<br>';
//задание 2
echo 'задание #2<br>';
echo $arr[0].$arr[1].$arr[2].'<br>';
//задание 3
echo 'задание #3<br>';
$arr = ['a', 'b', 'c', 'd'] ;
echo $arr[0].'+'.$arr[1].', '.$arr[2].'+'.$arr[3].', '.$arr[0].'-'.$arr[3].', '.$arr[0].'/'.$arr[3].'<br>';
//задание 4
echo 'задание #4<br>';
$arr=[2,5,3,9];
$result = ($arr[0] * $arr[1]) + ($arr[2] * $arr[3]);
echo $result.'<br>';
//задание 5
echo 'задание #5<br>';
$arr=null;
$arr[0]=1;
$arr[1]=4;
$arr[2]=3;
$arr[3]=5;
$arr[4]=2;
echo '-<br><br>';

//ЧАСТЬ 4
echo 'ЧАСТЬ 4<br>';
//задание 1
echo 'задание #1<br>';
$arr=['a'=>11, 'b'=>20, 'c'=>30];
echo $arr['c'].' '.($arr['a']+$arr['b']+$arr['c']).'<br>';
//задание 2
echo 'задание #2<br>';
$arr=['q3'=>12, 'r3'=>23, 'f3'=>34];
echo array_sum($arr).'<br>';
//задание 3
echo 'задание #3<br>';
$arr=['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo $arr['Петя'].' '.$arr['Коля'].'<br>';
//задание 4
echo 'задание #4<br>';
$arr=['1'=>'январь','2'=>'февраль','3'=>'март','4'=>'апрель','5'=>'май','6'=>'июнь','7'=>'июль','8'=>'август','9'=>'сентябрь','10'=>'октябрь','11'=>'ноябрь','12'=>'декабрь'];
echo $arr['9'].' '.$arr['6'].'<br>';
//задание 5
echo 'задание #5<br>';
$arr=[1=>'понедельник',2=>'вторник',3=>'среда',4=>'четверг',5=>'пятница',6=>'суббота',7=>'воскресенье'];
$day=3;
echo $arr[$day];


























